lets_do_stuff/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Happy"], ["created_at", "2015-10-23 06:29:06.161712"], ["updated_at", "2015-10-23 06:29:06.161712"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save