lets_do_stuff/app/controllers/user_infos_controller.rb

  def index
    @user_infos = UserInfo.all
---
SELECT "user_infos".* FROM "user_infos"

  def create
    @user_info = UserInfo.new(user_info_params)

    respond_to do |format|
      if @user_info.save
---
INSERT INTO "user_infos" ("name", "age", "location", "hobbies", "about_me", "string", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def set_user_info
      @user_info = UserInfo.find(params[:id])
---
SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."id" = $1 LIMIT 1  [["id", 1]]