app/views/rooms/show.html.erb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", 1]]
---
<div class="nav1">
<% if !UserRoom.where(:user_id  => current_user.id, :room_id => @room.id).present? %>